# DocumentEntryPoint Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentEntryPoint Constructor
DocumentEntryPoint Class See Also
---
Initializes a new instance of the DocumentEntryPoint class
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DocumentEntryPoint()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DocumentEntryPoint()
```

# See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace